app/views/blogs/index.html.erb

SELECT "tags".* FROM "tags"
---
  <br><%= blog.body %>
  <br><% blog.tag_list.each do |tag| %>