app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("user_id", "title", "body", "created_at", "updated_at", "start_time", "address") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["title", "ご飯"], ["body", "食べる"], ["created_at", "2020-11-09 12:15:48.209265"], ["updated_at", "2020-11-09 12:15:48.209265"], ["start_time", "2020-11-09 12:15:00"], ["address", ""]]
---
  def create
    @blog = current_user.blogs.new(blogs_params)
    @blog.save

SELECT "blogs".* FROM "blogs"
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('旅') OR LOWER(name) = LOWER('ロマン'))
---
  def index
    @blogs = Blog.all
    @tags = ActsAsTaggableOn::Tag.all

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "ご飯を"], ["updated_at", "2020-11-09 12:31:53.487149"], ["id", 18]]
---
  def update
    @blog = Blog.find(params[:id])
    @blog.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 9]]
---
  def destroy
    @blogs = Blog.find(params[:id])
    @blogs.destroy