app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ? ORDER BY "blogs"."id" DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 25], ["OFFSET", 0]]
---
    def show
    @user = User.find(params[:id])
    @blogs = @user.blogs.page(params[:page]).reverse_order # ここを記述